APLit/MacbethQuestions.org
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+OPTIONS: num:0 h:2 toc:2
# num:0 = dont number any, h:2 = headings to level 2, toc:1 = only put a table of contents to level 1
#+TITLE:     Macbeth Act Questions
#+AUTHOR:    Alex Burns
# EXPORT = C-c C-e h h

# https://github.com/fniessen/refcard-org-mode
# /Emphasize/ (italics), *strongly* (bold), and */very strongly/* (bold italics), \\ = return

* Act 1
** Scene 1:
*** What effect is Shakespeare creating by beginning the play with this scene?
**** Shakespeare is creating the effect of conflict through the thunder and lightning, as well as good vs evil with the witches. He also sets the theme of the play through the words “Fair is Foul, and Foul is fair”. Creating suspense and mystery from the weird sisters.

*** What is the meaning of the line, “Fair is foul, and foul is fair”?
**** Fair is good looking on the in and out, and foul is bleh/gross. The meaning is that those who appear on the outside to be fair are actually on the inside foul(up to no good) while those who appear foul on the outside are fair. Things are not as they appear, and are in reality opposites.

*** What poetic device is used in this scene and to what effect?
**** Alliteration was used in this scene (F in fair foul fog and filthy), it allows the audience to consider and think about the meaning since the alliteration draws attention to it and emphasizes the witches base slovenliness.

** Scene 2:
*** What is the purpose of this scene?
**** The purpose of this scene is that Duncan, who is the king of Scotland, hears of the victory of the war thanks to Macbeth and Banquo, and sends messengers to Macbeth to congratulate him and give him thane of Cawdor. We also learn of Macbeth as being a hero as he is brave

*** What image do readers have of Macbeth’s bravery and ability as a warrior?
**** We have the image that Macbeth is a hero who willingly risks his life as he charges into battle when the enemies swarm Macbeth and Banquo. That he is fearless, and a good man fighting for his country.

*** Who had Macbeth and Banquo been fighting?
**** Macbeth and Banquo were fighting soldiers of Norway and a rebellion led by Macdonwald.

*** What does King Duncan tell Ross to do?
**** King Duncan tells Ross to give Macbeth thane of Cawdor since the person who was originally the thane died in battle. Ross is basically king Duncan’s messenger as he is sent of to tell Macbeth of his new position/news

** Scene 3:
*** What does the audience learn about the Weird Sisters from their conversation at the beginning of the scene?
**** The audience learns that the Weird Sisters are creating a storm because of someone that disrespected them. We get the impression that they are powerful and mischievous.

*** When Macbeth says, “So foul and fair a day I have not seen,” to what is he referring? What could be the dramatic irony in this line?
**** Macbeth is referring to the battle and the people that died along with him as foul, but their victory as fair. The dramatic irony is that he has not seen the foul and fair part of the day yet, as the witches telling him what he will be (thane of Cawdor, king) etc is actually a curse on his mentality as now he feels as he must do whatever he can to achieve it.

*** What prophecies do the Weird Sisters make regarding Macbeth? How does he react?
**** They make the prophecies that Macbeth will become Thane of Cawdor and King afterwards. He reacts by being intrigued while Banquo tells them to be quiet and he doesn't care about what they say.

*** What do the Weird Sisters see in the future for Banquo?
**** The weird sisters see that the son’s of Banquo will become kings after Macbeth's death. They will take over the thrown.

*** How do Macbeth and Banquo react to the experience after the Weird Sisters vanish?
**** Banquo thinks that they came and went and that it doesn't matter what they say. They consider that the meds they took are causing delusions and corrupting their minds. Then they joke around with each other.

*** What “terms” does Ross indicate accompany the title Thane of Cawdor?
**** That he is both thane of cawdor and thane of glamis. He also states that the Thane of Cawdor is the most worthy thane, as it is thine.

*** As the others talk, what does Macbeth’s aside reveal about his thinking?
**** Macbeth’s aside reveals that he is curious and even thought about killing the king to fulfill his prophecy. He is starting to believe what the witches told him and he thinks it is too real and that it is his new destiny. Essentially becoming mentally crazy
*** How does Banquo’s comment support the “Fair is foul, foul is fair” theme?

**** Banquo’s comment supports the theme that he should be careful and not believe everything that he hears, which ultimately leads him to killing Duncan with the help of his manipulative wife. He is saying that while this all sounds great on the outside, something bad would likely come as a result of it.

*** What does Macbeth mean in his aside about two truths being prologue to the act of the imperial theme?
**** Macbeth means that both things that the witches said (thane of cawdor and king) will both come true, and that he will become the king (imperial theme). Macbeth in his aside means that these things sound good but there must be an ill that comes with them (cannot be ill, cannot be good)

*** What dramatic conventions does Shakespeare use to establish character and begin to lay out his tragedy?
**** Shakespeare uses a constant back and forth of Macbeth’s ideas/opinions to establish that he does not have the ruthlessness to kill king Duncan, and that he himself would decide not to kill Duncan. It lays out the tragedy of someone else convincing him to do so, as Banquo convinces him that his thoughts are ridiculous and that he is crazy and needs to rethink what happened as a single strange occurrence.

** Scene 4:
*** Why was the former Thane of Cawdor executed?
