APLit/MacbethQuestions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-25 Sat 11:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Macbeth Act Questions</title>
<meta name="author" content="Alex Burns" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Macbeth Act Questions</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf72fd7d">Act 1</a>
<ul>
<li><a href="#org502f7c7">Scene 1:</a></li>
<li><a href="#orgfd50f42">Scene 2:</a></li>
<li><a href="#org9850a6f">Scene 3:</a></li>
<li><a href="#orgdd7baf0">Scene 4:</a></li>
<li><a href="#orgf1621fe">Scene 5:</a></li>
<li><a href="#orgdd2c04d">Scene 6:</a></li>
<li><a href="#orgde4f2e3">Scene 7:</a></li>
</ul>
</li>
<li><a href="#org5631c2c">Act 2</a>
<ul>
<li><a href="#orgabc0b3e">Scene 1:</a></li>
<li><a href="#org55e0c41">Scene 2:</a></li>
<li><a href="#org3e70a55">Scene 3:</a></li>
<li><a href="#orge39c036">Scene 4:</a></li>
</ul>
</li>
<li><a href="#orgadcc337">Act 3</a>
<ul>
<li><a href="#org2da2e25">Scene 1:</a></li>
<li><a href="#org1599af5">Scene 2:</a></li>
<li><a href="#orgf67d5ef">Scene 3:</a></li>
<li><a href="#org447d750">Scene 4:</a></li>
<li><a href="#org1c9edd7">Scene 5:</a></li>
<li><a href="#orgb087671">Scene 6:</a></li>
</ul>
</li>
<li><a href="#orgc2fd67e">Act 4</a>
<ul>
<li><a href="#org7abb559">Scene 1:</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgf72fd7d" class="outline-2">
<h2 id="orgf72fd7d">Act 1</h2>
<div class="outline-text-2" id="text-orgf72fd7d">
</div>
<div id="outline-container-org502f7c7" class="outline-3">
<h3 id="org502f7c7">Scene 1:</h3>
<div class="outline-text-3" id="text-org502f7c7">
</div>
<ul class="org-ul">
<li><a id="org19044d3"></a>What effect is Shakespeare creating by beginning the play with this scene?<br />
<ul class="org-ul">
<li><a id="orgda2b32e"></a>Shakespeare is creating the effect of conflict through the thunder and lightning, as well as good vs evil with the witches. He also sets the theme of the play through the words “Fair is Foul, and Foul is fair”. Creating suspense and mystery from the weird sisters.<br /></li>
</ul>
</li>

<li><a id="orgfdee5ae"></a>What is the meaning of the line, “Fair is foul, and foul is fair”?<br />
<ul class="org-ul">
<li><a id="org65d0d7d"></a>Fair is good looking on the in and out, and foul is bleh/gross. The meaning is that those who appear on the outside to be fair are actually on the inside foul(up to no good) while those who appear foul on the outside are fair. Things are not as they appear, and are in reality opposites.<br /></li>
</ul>
</li>

<li><a id="org9ca9cf8"></a>What poetic device is used in this scene and to what effect?<br />
<ul class="org-ul">
<li><a id="orga7626b5"></a>Alliteration was used in this scene (F in fair foul fog and filthy), it allows the audience to consider and think about the meaning since the alliteration draws attention to it and emphasizes the witches base slovenliness.<br /></li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-orgfd50f42" class="outline-3">
<h3 id="orgfd50f42">Scene 2:</h3>
<div class="outline-text-3" id="text-orgfd50f42">
</div>
<ul class="org-ul">
<li><a id="org8d12b53"></a>What is the purpose of this scene?<br />
<ul class="org-ul">
<li><a id="org297557c"></a>The purpose of this scene is that Duncan, who is the king of Scotland, hears of the victory of the war thanks to Macbeth and Banquo, and sends messengers to Macbeth to congratulate him and give him thane of Cawdor. We also learn of Macbeth as being a hero as he is brave<br /></li>
</ul>
</li>

<li><a id="org85c960e"></a>What image do readers have of Macbeth’s bravery and ability as a warrior?<br />
<ul class="org-ul">
<li><a id="org03bb4d7"></a>We have the image that Macbeth is a hero who willingly risks his life as he charges into battle when the enemies swarm Macbeth and Banquo. That he is fearless, and a good man fighting for his country.<br /></li>
</ul>
</li>

<li><a id="org7452d21"></a>Who had Macbeth and Banquo been fighting?<br />
<ul class="org-ul">
<li><a id="org02c17bc"></a>Macbeth and Banquo were fighting soldiers of Norway and a rebellion led by Macdonwald.<br /></li>
</ul>
</li>

<li><a id="org4719773"></a>What does King Duncan tell Ross to do?<br />
<ul class="org-ul">
<li><a id="orga99d44a"></a>King Duncan tells Ross to give Macbeth thane of Cawdor since the person who was originally the thane died in battle. Ross is basically king Duncan’s messenger as he is sent of to tell Macbeth of his new position/news<br /></li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-org9850a6f" class="outline-3">
<h3 id="org9850a6f">Scene 3:</h3>
<div class="outline-text-3" id="text-org9850a6f">
</div>
<ul class="org-ul">
<li><a id="org5659920"></a>What does the audience learn about the Weird Sisters from their conversation at the beginning of the scene?<br />
<ul class="org-ul">
<li><a id="orgcf38df8"></a>The audience learns that the Weird Sisters are creating a storm because of someone that disrespected them. We get the impression that they are powerful and mischievous.<br /></li>
</ul>
</li>

<li><a id="orge47ab98"></a>When Macbeth says, “So foul and fair a day I have not seen,” to what is he referring? What could be the dramatic irony in this line?<br />
<ul class="org-ul">
<li><a id="org97e27ec"></a>Macbeth is referring to the battle and the people that died along with him as foul, but their victory as fair. The dramatic irony is that he has not seen the foul and fair part of the day yet, as the witches telling him what he will be (thane of Cawdor, king) etc is actually a curse on his mentality as now he feels as he must do whatever he can to achieve it.<br /></li>
</ul>
</li>

<li><a id="orge0872bc"></a>What prophecies do the Weird Sisters make regarding Macbeth? How does he react?<br />
<ul class="org-ul">
<li><a id="orgeb46a18"></a>They make the prophecies that Macbeth will become Thane of Cawdor and King afterwards. He reacts by being intrigued while Banquo tells them to be quiet and he doesn&rsquo;t care about what they say.<br /></li>
</ul>
</li>

<li><a id="orgd6b6934"></a>What do the Weird Sisters see in the future for Banquo?<br />
<ul class="org-ul">
<li><a id="orga91a200"></a>The weird sisters see that the son’s of Banquo will become kings after Macbeth&rsquo;s death. They will take over the thrown.<br /></li>
</ul>
</li>

<li><a id="orgf9dacfa"></a>How do Macbeth and Banquo react to the experience after the Weird Sisters vanish?<br />
<ul class="org-ul">
<li><a id="orgc60d2f6"></a>Banquo thinks that they came and went and that it doesn&rsquo;t matter what they say. They consider that the meds they took are causing delusions and corrupting their minds. Then they joke around with each other.<br /></li>
</ul>
</li>

<li><a id="orgb162afa"></a>What “terms” does Ross indicate accompany the title Thane of Cawdor?<br />
<ul class="org-ul">
<li><a id="org31cea61"></a>That he is both thane of cawdor and thane of glamis. He also states that the Thane of Cawdor is the most worthy thane, as it is thine.<br /></li>
</ul>
</li>

<li><a id="orgc61ec3b"></a>As the others talk, what does Macbeth’s aside reveal about his thinking?<br />
<ul class="org-ul">
<li><a id="orgcab1881"></a>Macbeth’s aside reveals that he is curious and even thought about killing the king to fulfill his prophecy. He is starting to believe what the witches told him and he thinks it is too real and that it is his new destiny. Essentially becoming mentally crazy<br /></li>
</ul>
</li>
<li><a id="org3fa90c4"></a>How does Banquo’s comment support the “Fair is foul, foul is fair” theme?<br />
<ul class="org-ul">
<li><a id="org66bdc9c"></a>Banquo’s comment supports the theme that he should be careful and not believe everything that he hears, which ultimately leads him to killing Duncan with the help of his manipulative wife. He is saying that while this all sounds great on the outside, something bad would likely come as a result of it.<br /></li>
</ul>
</li>

<li><a id="orgcffab30"></a>What does Macbeth mean in his aside about two truths being prologue to the act of the imperial theme?<br />
<ul class="org-ul">
<li><a id="orgb2da245"></a>Macbeth means that both things that the witches said (thane of cawdor and king) will both come true, and that he will become the king (imperial theme). Macbeth in his aside means that these things sound good but there must be an ill that comes with them (cannot be ill, cannot be good)<br /></li>
</ul>
</li>

<li><a id="org13886b2"></a>What dramatic conventions does Shakespeare use to establish character and begin to lay out his tragedy?<br />
<ul class="org-ul">
<li><a id="orgf504779"></a>Shakespeare uses a constant back and forth of Macbeth’s ideas/opinions to establish that he does not have the ruthlessness to kill king Duncan, and that he himself would decide not to kill Duncan. It lays out the tragedy of someone else convincing him to do so, as Banquo convinces him that his thoughts are ridiculous and that he is crazy and needs to rethink what happened as a single strange occurrence.<br /></li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-orgdd7baf0" class="outline-3">
<h3 id="orgdd7baf0">Scene 4:</h3>
<div class="outline-text-3" id="text-orgdd7baf0">
</div>
<ul class="org-ul">
<li><a id="org7895dc5"></a>Why was the former Thane of Cawdor executed?<br />
<ul class="org-ul">
