APLit/MacbethQuestions.org
**** The former Thane of Cawdor was executed because of his sins and that he confessed his treasons (Deserved to die).

*** What effect does Shakespeare create by having Macbeth and Banquo enter just as they are discussing the execution of the former Thane of Cawdor?
**** Shakespeare creates the effect of misplaced trust, which adds to the theme of the play. Macbeth enters after Duncan reflects as he thought he was a great man but he turned out evil which almost foreshadows the man who Macbeth is going to become.

*** What announcement does the King make to everyone present and what is Macbeth’s reaction?
**** The king makes the announcement that Malcolm is going to become king after Duncan instead of Macbeth, that Malcolm is the new heir to the throne. Macbeth tells duncan that he is going to tell his wife of there approach, trying to get out of there as fast as possible, but he is actually thinking (below).

*** In his last speech in this scene, what does Macbeth reveal?
**** Macbeth realizes that he must retreat and never become king or to kill both Duncan and Malcolm in order to secure the throne. Plants his thoughts of murder in his mind.

** Scene 5:
*** What is the purpose of the letter?
**** The purpose of the letter is to let Lady Macbeth know about the witches and what they said and how he as become thane of cawdor etc, and then she later finds out that Duncan is staying at there place.

*** What do readers learn about Macbeth from Lady Macbeth’s reaction to the letter?
**** Readers learn that Macbeth is too kind of a person to kill Duncan, as he is currently too loyal to do so. She knows that he is going to make his mind up against killing him.

*** What do readers learn about Lady Macbeth from her reaction to the letter?
**** Readers learn that Lady Macbeth is ruthless. She doesn't say that she is happy her husband didn't die or proud of him, she instead instantly starts thinking of how to kill Duncan, and decides on doing so without having a second thought.

*** Does Lady Macbeth fear Macbeth will not be king if he does not murder Duncan?
**** Yes, Lady Macbeth wants to be queen so much that she will not let anything get in the way of her husband becoming King.

*** How does the news about King Duncan’s expected arrival affect her? What is she planning?
**** It leads her to start planning his murder. She realizes that the easiest place to do something like this is in her own home, since they would be the ones protecting him and watching over him instead of his servants.

*** Why does Lady Macbeth pray to be unsexed? Explain.
**** Lady Macbeth prays to be unsexed because she believes that women are not cruel enough to do such a deed, while men are. She wants to become a man inorder to kill Duncan herself. Again, she is doing anything for her husband to be king.

*** What does Shakespeare establish in Macbeth and Lady Macbeth’s first exchange when Macbeth arrives home?
**** Shakespeare establishes that Duncan will not see the sun of the next morning and that by saying all-hail hereafter! She is going to do everything to become queen and she fully believes its Macbeth’s destiny.

*** In what way does Lady Macbeth’s advice to Macbeth relate to the “fair is foul” theme?
**** Lady Macbeth’s advice to appear like a flower but be a serpent on the inside relates to the theme of the novel in that those who appear nasty have good intentions while those who are fake have bad intentions. Parallels to social media today and “Float like a butterfly, sting like a bee” from cars. (haha)

** Scene 6:
*** What is the purpose of this brief scene?
**** The purpose of this scene is to set the scene that Duncan is happy to be staying at macbeths as he things he is the best man he knows, a hero, brave, etc. Then they run into lady macbeth which sets the scene later where macbeth isnt there.

*** How does this scene contribute to the “fair is foul” theme?
**** The scene contributes to the theme in that Lady Macbeth appears super friendly and nice as usual even though she is scheming to murder him in his sleep.

** Scene 7:
*** What arguments does Macbeth raise for not killing Duncan?
**** Macbeth raises the arguments that he should not kill Duncan because he does not want karma or a chain of violence to come back to him, and the Duncan does not know that he is his enemy because Macbeth is his kinsman and his host, who should be the ones protecting him from someone murdering him.

*** What does he finally conclude?
**** He finally concludes to not murder Duncan and that doing so would lead to bad consequences.

*** What consequences does Macbeth fear if he commits the murder?
**** He fears that he himself might be killed by Duncan’s sons or that nothing is stopping others from killing him. Also that if he gets caught then they will likely be killed.

*** What does Lady Macbeth say in an attempt to goad her husband into the murder?
**** Lady Macbeth manipulates him and guilt trips him by saying that he made a promise and that he should not break it, even though he never made a promise to kill Duncan.

*** Macbeth’s response to her about what a man may dare is frequently quoted. What is his meaning?
**** Its meaning is that by hiding that they are the ones who killed Duncan by framing the services and crying and acting sad to the public, they are the ones being fake and are hiding their false and negative hearts, again contributing to the theme of the tragedy.

*** What is the point of Lady Macbeth’s baby imagery? Note the times images of babies and mothers are presented in this play.
**** The point is that she is manipulating Macbeth into killing Duncan by saying that she would do anything for him, including killing a baby for his good, which is obviously very crazy and highly frowned upon.

*** What exposition does Shakespeare give the audience in this scene?
**** Shakespeare creates irony between Macbeth and Lady Macbeth through the contrast of their opinions, as well as indirectly mentions the manipulation of those who love you for their own good. Shows a negative power of love that many do not typically consider.
* Act 2
** Scene 1:
*** What is significant about the weather? (Discuss symbolism)
**** The thing that is significant about the weather is that the moon is down, symbolizing how night is upon us and therefore evil is upon the castle. We associate light with good items and dark with evil

*** What do you suppose is keeping Banquo from sleeping?
