APLit/MacbethQuestions.html
<li><a id="org689d77c"></a>The former Thane of Cawdor was executed because of his sins and that he confessed his treasons (Deserved to die).<br /></li>
</ul>
</li>

<li><a id="org4e439cf"></a>What effect does Shakespeare create by having Macbeth and Banquo enter just as they are discussing the execution of the former Thane of Cawdor?<br />
<ul class="org-ul">
<li><a id="org477399a"></a>Shakespeare creates the effect of misplaced trust, which adds to the theme of the play. Macbeth enters after Duncan reflects as he thought he was a great man but he turned out evil which almost foreshadows the man who Macbeth is going to become.<br /></li>
</ul>
</li>

<li><a id="orgbfa4b66"></a>What announcement does the King make to everyone present and what is Macbeth’s reaction?<br />
<ul class="org-ul">
<li><a id="org6953532"></a>The king makes the announcement that Malcolm is going to become king after Duncan instead of Macbeth, that Malcolm is the new heir to the throne. Macbeth tells duncan that he is going to tell his wife of there approach, trying to get out of there as fast as possible, but he is actually thinking (below).<br /></li>
</ul>
</li>

<li><a id="orgb7ff354"></a>In his last speech in this scene, what does Macbeth reveal?<br />
<ul class="org-ul">
<li><a id="org7c1b37e"></a>Macbeth realizes that he must retreat and never become king or to kill both Duncan and Malcolm in order to secure the throne. Plants his thoughts of murder in his mind.<br /></li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-orgf1621fe" class="outline-3">
<h3 id="orgf1621fe">Scene 5:</h3>
<div class="outline-text-3" id="text-orgf1621fe">
</div>
<ul class="org-ul">
<li><a id="org1abbfa5"></a>What is the purpose of the letter?<br />
<ul class="org-ul">
<li><a id="org3533433"></a>The purpose of the letter is to let Lady Macbeth know about the witches and what they said and how he as become thane of cawdor etc, and then she later finds out that Duncan is staying at there place.<br /></li>
</ul>
</li>

<li><a id="org689d5c2"></a>What do readers learn about Macbeth from Lady Macbeth’s reaction to the letter?<br />
<ul class="org-ul">
<li><a id="orgf7c044b"></a>Readers learn that Macbeth is too kind of a person to kill Duncan, as he is currently too loyal to do so. She knows that he is going to make his mind up against killing him.<br /></li>
</ul>
</li>

<li><a id="orgf58f800"></a>What do readers learn about Lady Macbeth from her reaction to the letter?<br />
<ul class="org-ul">
<li><a id="org35c0c94"></a>Readers learn that Lady Macbeth is ruthless. She doesn&rsquo;t say that she is happy her husband didn&rsquo;t die or proud of him, she instead instantly starts thinking of how to kill Duncan, and decides on doing so without having a second thought.<br /></li>
</ul>
</li>

<li><a id="orga6bda27"></a>Does Lady Macbeth fear Macbeth will not be king if he does not murder Duncan?<br />
<ul class="org-ul">
<li><a id="org3f1c043"></a>Yes, Lady Macbeth wants to be queen so much that she will not let anything get in the way of her husband becoming King.<br /></li>
</ul>
</li>

<li><a id="orgfc04ad4"></a>How does the news about King Duncan’s expected arrival affect her? What is she planning?<br />
<ul class="org-ul">
<li><a id="org567bfa4"></a>It leads her to start planning his murder. She realizes that the easiest place to do something like this is in her own home, since they would be the ones protecting him and watching over him instead of his servants.<br /></li>
</ul>
</li>

<li><a id="org8ebe095"></a>Why does Lady Macbeth pray to be unsexed? Explain.<br />
<ul class="org-ul">
<li><a id="orgcb0aafa"></a>Lady Macbeth prays to be unsexed because she believes that women are not cruel enough to do such a deed, while men are. She wants to become a man inorder to kill Duncan herself. Again, she is doing anything for her husband to be king.<br /></li>
</ul>
</li>

<li><a id="org7e52c00"></a>What does Shakespeare establish in Macbeth and Lady Macbeth’s first exchange when Macbeth arrives home?<br />
<ul class="org-ul">
<li><a id="orgead8a19"></a>Shakespeare establishes that Duncan will not see the sun of the next morning and that by saying all-hail hereafter! She is going to do everything to become queen and she fully believes its Macbeth’s destiny.<br /></li>
</ul>
</li>

<li><a id="org241302c"></a>In what way does Lady Macbeth’s advice to Macbeth relate to the “fair is foul” theme?<br />
<ul class="org-ul">
<li><a id="org35866d3"></a>Lady Macbeth’s advice to appear like a flower but be a serpent on the inside relates to the theme of the novel in that those who appear nasty have good intentions while those who are fake have bad intentions. Parallels to social media today and “Float like a butterfly, sting like a bee” from cars. (haha)<br /></li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-orgdd2c04d" class="outline-3">
<h3 id="orgdd2c04d">Scene 6:</h3>
<div class="outline-text-3" id="text-orgdd2c04d">
</div>
<ul class="org-ul">
<li><a id="org065ee8f"></a>What is the purpose of this brief scene?<br />
<ul class="org-ul">
<li><a id="org4c53431"></a>The purpose of this scene is to set the scene that Duncan is happy to be staying at macbeths as he things he is the best man he knows, a hero, brave, etc. Then they run into lady macbeth which sets the scene later where macbeth isnt there.<br /></li>
</ul>
</li>

<li><a id="org83a50e1"></a>How does this scene contribute to the “fair is foul” theme?<br />
<ul class="org-ul">
<li><a id="orgd93dcc1"></a>The scene contributes to the theme in that Lady Macbeth appears super friendly and nice as usual even though she is scheming to murder him in his sleep.<br /></li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-orgde4f2e3" class="outline-3">
<h3 id="orgde4f2e3">Scene 7:</h3>
<div class="outline-text-3" id="text-orgde4f2e3">
</div>
<ul class="org-ul">
<li><a id="org780e53a"></a>What arguments does Macbeth raise for not killing Duncan?<br />
<ul class="org-ul">
<li><a id="orgc7a4be7"></a>Macbeth raises the arguments that he should not kill Duncan because he does not want karma or a chain of violence to come back to him, and the Duncan does not know that he is his enemy because Macbeth is his kinsman and his host, who should be the ones protecting him from someone murdering him.<br /></li>
</ul>
</li>

<li><a id="orgf2566a9"></a>What does he finally conclude?<br />
<ul class="org-ul">
<li><a id="org7d1b59f"></a>He finally concludes to not murder Duncan and that doing so would lead to bad consequences.<br /></li>
</ul>
</li>

<li><a id="org1a9fc8c"></a>What consequences does Macbeth fear if he commits the murder?<br />
<ul class="org-ul">
<li><a id="orgd938ca1"></a>He fears that he himself might be killed by Duncan’s sons or that nothing is stopping others from killing him. Also that if he gets caught then they will likely be killed.<br /></li>
</ul>
</li>

<li><a id="orga902d2c"></a>What does Lady Macbeth say in an attempt to goad her husband into the murder?<br />
<ul class="org-ul">
<li><a id="orgeac7eaa"></a>Lady Macbeth manipulates him and guilt trips him by saying that he made a promise and that he should not break it, even though he never made a promise to kill Duncan.<br /></li>
</ul>
</li>

<li><a id="orgb32d731"></a>Macbeth’s response to her about what a man may dare is frequently quoted. What is his meaning?<br />
<ul class="org-ul">
<li><a id="org3e7de2f"></a>Its meaning is that by hiding that they are the ones who killed Duncan by framing the services and crying and acting sad to the public, they are the ones being fake and are hiding their false and negative hearts, again contributing to the theme of the tragedy.<br /></li>
</ul>
</li>

<li><a id="orgd57b3e2"></a>What is the point of Lady Macbeth’s baby imagery? Note the times images of babies and mothers are presented in this play.<br />
<ul class="org-ul">
<li><a id="org29f6220"></a>The point is that she is manipulating Macbeth into killing Duncan by saying that she would do anything for him, including killing a baby for his good, which is obviously very crazy and highly frowned upon.<br /></li>
</ul>
</li>

<li><a id="org1b613d6"></a>What exposition does Shakespeare give the audience in this scene?<br />
<ul class="org-ul">
<li><a id="org0ec3a51"></a>Shakespeare creates irony between Macbeth and Lady Macbeth through the contrast of their opinions, as well as indirectly mentions the manipulation of those who love you for their own good. Shows a negative power of love that many do not typically consider.<br /></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org5631c2c" class="outline-2">
<h2 id="org5631c2c">Act 2</h2>
<div class="outline-text-2" id="text-org5631c2c">
</div>
<div id="outline-container-orgabc0b3e" class="outline-3">
<h3 id="orgabc0b3e">Scene 1:</h3>
<div class="outline-text-3" id="text-orgabc0b3e">
</div>
<ul class="org-ul">
<li><a id="orgf54aac4"></a>What is significant about the weather? (Discuss symbolism)<br />
<ul class="org-ul">
<li><a id="org2d8e827"></a>The thing that is significant about the weather is that the moon is down, symbolizing how night is upon us and therefore evil is upon the castle. We associate light with good items and dark with evil<br /></li>
</ul>
</li>
