APLit/MacbethQuestions.html

<li><a id="orgfcbfbdc"></a>What do you suppose is keeping Banquo from sleeping?<br />
<ul class="org-ul">
<li><a id="orgfd257c4"></a>I suppose that the prophecy, witches, and worrying about macbeth is presenting Banquo from sleeping<br /></li>
</ul>
</li>

<li><a id="org8f77a0a"></a>What is significant about Macbeth’s saying, “I think not of them,” after Banquo had admitted to dreaming about the Weird Sisters?<br />
<ul class="org-ul">
<li><a id="org4dc817b"></a>Macbeth is lying to his best friend because he does not want Banquo to be suspicious of his plan to murder the king. Anything that he would say about them would make him a suspect in Banquo’s eyes.<br /></li>
</ul>
</li>

<li><a id="org4d4caf2"></a>What does Macbeth mean when he says to Banquo, “If you shall cleave to my consent, when ’tis, / It shall make honour for you”?<br />
<ul class="org-ul">
<li><a id="org35d2e64"></a>Macbeth means that if Banquo supports him if he realizes that Macbeth killed Duncan than it will come to his benefit. He will gain something for keeping quiet.<br /></li>
</ul>
</li>

<li><a id="orgb24bf04"></a>What is significant about Banquo’s reply?<br />
<ul class="org-ul">
<li><a id="org511904b"></a>It is significant in Banquo’s reply that he says “So I loose none”, which is when he is indirectly questioning if Macbeth is going to do something he shouldnt. It also says that Banquo’s allegiance is to Duncan, so he would kill Macbeth if it came to it.<br /></li>
</ul>
</li>

<li><a id="orgfe2d985"></a>In his soliloquy after Banquo leaves, what does Macbeth tell the audience (readers) he sees? What could account for this apparition?<br />
<ul class="org-ul">
<li><a id="org31d7885"></a>Macbeth tells the audience that he sees the dagger that was used to kill duncan. His guilt could account for this apparition as he is worried and doesnt think that it is a great idea.<br /></li>
</ul>
</li>

<li><a id="orgcf55c4a"></a>Why does Shakespeare have Macbeth hallucinate?<br />
<ul class="org-ul">
<li><a id="org75d2901"></a>Shakespeare has Macbeth hallucinate to show how his mind is going crazy and messing with him as he contemplates killing the king, who he is loyal to.<br /></li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-org55e0c41" class="outline-3">
<h3 id="org55e0c41">Scene 2:</h3>
<div class="outline-text-3" id="text-org55e0c41">
</div>
<ul class="org-ul">
<li><a id="org04f713f"></a>Compare Macbeth’s and Lady Macbeth’s reactions immediately after the crime.<br />
<ul class="org-ul">
<li><a id="org1351323"></a>Macbeth is thinking that this is terrible news and is acting shocked. Lady Macbeth also acts shocked by being way more loud and fake about it by fainting or pretending to.<br /></li>
</ul>
</li>

<li><a id="org4610d03"></a>Why does Lady Macbeth not commit the murder when she is in the room?<br />
<ul class="org-ul">
<li><a id="org8d6a2ee"></a>She does not commit the murder because Duncan reminded her of her father. Otherwise she says that she had done it.<br /></li>
</ul>
</li>

<li><a id="org0b7441d"></a>Macbeth, apparently troubled by the murder he has just committed, tells Lady Macbeth what he saw and heard. She tells him, “These deeds must not be thought of this way.” Why?<br />
<ul class="org-ul">
<li><a id="org8a8463c"></a>She wants him to forget what happened and just move on thinking that its fine. She wants Macbeth to forget about the guilt and to not think of it as a sin.<br /></li>
</ul>
</li>

<li><a id="org186b37c"></a>Macbeth’s response is frequently quoted. What is the sense of this response?<br />
<ul class="org-ul">
<li><a id="org3abce9e"></a>The sense of his response is that the deed is going to drive him crazy because he cannot live with the guilt and the constant thought of someone accusing him of the murder.<br /></li>
</ul>
</li>

<li><a id="org5ecbf19"></a>How does Lady Macbeth get Duncan’s blood on her hands?<br />
<ul class="org-ul">
<li><a id="orgc79e740"></a>Lady Macbeth gets Duncan’s blood on her hands by using the dagger that was used to kill Duncan.<br /></li>
</ul>
</li>

<li><a id="org74fd8e6"></a>What does Macbeth’s refusal to return to Duncan’s chamber echo?<br />
<ul class="org-ul">
<li><a id="orga223c8a"></a>It echos that Macbeth is too light hearted and manipulated into committing such a task. He regrets his decision deeply and wishes to reverse it<br /></li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-org3e70a55" class="outline-3">
<h3 id="org3e70a55">Scene 3:</h3>
<div class="outline-text-3" id="text-org3e70a55">
</div>
<ul class="org-ul">
<li><a id="org412c886"></a>The Porter’s scene, or the “knocking at the gate,” is a much debated scene by scholars, but many agree it is the typical comic relief scene seen in Shakespeare’s plays. What do you suppose the dramatic purpose of a comic relief scene is? Why is the Porter’s soliloquy in prose rather than poetry? What lines contain the bawdy humor so often found in these scenes?<br />
<ul class="org-ul">
<li><a id="orge799f6b"></a>The dramatic purpose of a comic relief scene is to juxtapose it with the scene of a tragedy/murder. This is to lighten the mood of the audience after a murder has been committed. The porter’s soliloquy is in prose because it is supposed to show how he is from a lower class and is not as elegant as the rest. Lines 29-37 when he is responding to Macduff and talking about what alcohol causes one to do.<br /></li>
</ul>
</li>
<li><a id="orgb2ad193"></a>How is the theme idea of “a crime against nature” reinforced in this scene?<br />
<ul class="org-ul">
<li><a id="orgf3bd781"></a>The theme is reinforced through the comparison of Duncan to a church and the devil was the one who killed Duncan. The devil in this case is Macbeth, and this theme is represented by Macduffs explanation of the deed to the others, as he questions why someone would commit such a terrible crime.<br /></li>
</ul>
</li>
<li><a id="orgaf98833"></a>What does Shakespeare accomplish with Macduff’s allusion to “a new Gorgon”?<br />
<ul class="org-ul">
<li><a id="orgf1c5191"></a>Shakespeare causes the effect of an inside job/crime in his allusion. He is saying that someone did not protect the castle as a gorgon is a mythical creature that is supposed to turn evil into stone, creating the effect in the audience of contrast in that Macbeth committed the crime even though he was supposed to be defending the king.<br /></li>
</ul>
</li>
<li><a id="org3034a85"></a>How does Macbeth react to the discovery of Duncan’s body?<br />
<ul class="org-ul">
<li><a id="orgd95db87"></a>Macbeth reacts to the discovery of Duncan’s body by stating that he would have rather died than see the sight of his dead king, and the audience realizes how he is being truthful and how guilt has overwhelmed him.<br /></li>
</ul>
</li>
<li><a id="org4ea1d72"></a>How does Lady Macbeth react?<br />
<ul class="org-ul">
<li><a id="orgeaede63"></a>Lady Macbeth reacts by asking for help as she faints to the ground. She might also be drawing the suspicion off of Macbeth by causing a distraction, but that is rather unlikely as she likely does not have his back. People think that she is too soft and would never think of committing such an evil crime.<br /></li>
</ul>
</li>
<li><a id="orge70a8e4"></a>Who is the one who points out the inappropriateness of Lady Macbeth’s initial response?<br />
<ul class="org-ul">
<li><a id="org02a1b3d"></a>Macduff, as Lady Macbeth acts annoyed by the bell but Macduff knows the crime that has commited. Macduff states that she is too fragile of a woman and would faint if she heard what had happened in the night.<br /></li>
</ul>
</li>
<li><a id="org365d59e"></a>What is the predominant image in this scene, and what effect does it create?<br />
<ul class="org-ul">
<li><a id="org5b091f7"></a>The predominant image is a facade in that Lady Macbeth and Macbeth are both acting fake. This creates the effect of something unusual happening here, which is later expanded in scene 4 by the old man and ross.<br /></li>
</ul>
</li>
<li><a id="orgb740a2f"></a>What double meaning might Shakespeare have intended for Macbeth’s line, “He does: he did appoint so,” in response to Lennox’s asking, “Goes the King hence today?”<br />
<ul class="org-ul">
<li><a id="org0d7ee5c"></a>Shakespeare intended that Duncan intended to leave today but Macbeth knows that he won&rsquo;t because he killed him in his sleep.<br /></li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-orge39c036" class="outline-3">
<h3 id="orge39c036">Scene 4:</h3>
<div class="outline-text-3" id="text-orge39c036">
</div>
<ul class="org-ul">
<li><a id="org462be17"></a>What is the purpose of this scene?<br />
<ul class="org-ul">
<li><a id="org29a1ac6"></a>The purpose of this scene is to show how unusual and weird the crime was. The two are trying to figure out who committed it, but they don&rsquo;t understand the motives behind the servants doing so. This is possibly hinting at Duncan&rsquo;s two sons receiving the blame because they are the ones who are fleeing and leaving the country. We know that this is because they think that they are going to be killed next.<br /></li>
</ul>
</li>

<li><a id="org72b3a4f"></a>What additional natural, or “unnatural,” events further the “crime against nature” theme?<br />
<ul class="org-ul">
