APLit/MacbethQuestions.org
**** The events that further the crime against nature theme are that because the two believe the servants had no motive to do it, and that the two sons are leaving the country but they think it is not because they bribed anyone, then the most likely person who would have commited the crime would be Macbeth, but he is said to be loyal to the King and such an honorable person, and it would not be right if he killed the person he cared about.

* Act 3
** Scene 1:
*** In his soliloquy, what suspicion and hope does Banquo reveal?
**** Banquo reveals that he is suspicious of Macbeths treason and murder of king Duncan. He hopes that Macbeth did not take the witches prophecy into his own hands and that his friend is still good.

*** Macbeth seems to be very interested in Banquo’s travel plans. Why do you suppose he is so interested?
**** Macbeth is very interested in Banquo’s travel plans because he wants to know where he is and at what time inorder for the two murders to murder him. It would be wise to do it away from Macbeth's location so that he is not a suspect.

*** The speech beginning “To be thus is nothing...” is another one often quoted. What is the meaning of that sentence?
**** The meaning of that sentence is that to be King is nothing, but to be safely king is remarkable. This is because as a King, you almost always have a target on your back as someone wants to kill you.

*** What is there in Banquo’s character that makes Macbeth uneasy?
**** Macbeth is uneasy because he fears how Banquo is the good as he is honest and loyal, and fears that he will avenge the king and betray his friend.

*** What is there in the situation with Banquo that particularly upsets Macbeth?
**** Macbeth is upset that Banquo’s sons will be the air to the throne because he is a fruitless crown, meaning he has no offspring and therefore the royal crown will not be in his blood. Banquo’s sons basically benefit from no troubles at all.

*** What does Shakespeare offer in Macbeth’s conversation with the murderers?
**** Shakespeare on the surface offers that Macbeth would do it himself if he was not king, but he is really stating that Macbeth will not have the ability to kill his best friend himself because there is still some good in him.

*** How does Macbeth convince the murderers to kill Banquo and Fleance?
**** Macbeth manipulates the murders into thinking that Banquo is their enemy and has betrayed them. He makes them think that nothing should stop them from killing Banquo, which is why they are willing to kill Fleance.

*** What does Macbeth tell them to do?
**** Macbeth tells them to kill Banquo and Fleance tonight before supper while he is off and away riding his horse. He tells them to make sure the deed is done and to end it here once and for all.

** Scene 2:
*** What is the meaning of Lady Macbeth’s opening speech in this scene?
**** Lady Macbeth's opening speech reveals how she is scared and worries that things will not turn out well. It shows that she might of just been going along with her husband and that she might truly be regretting the murder they commited. However, when she talks to Macbeth, she is back to her crazy relentless personality.

*** In this scene, what is Macbeth’s state of mind?
**** Macbeth’s state of mind is paranoia and is scared for his life. He wishes he was dead and that because of the betrayal of those close to him he is going to hell so becoming more evil is not as much of an issue anymore. He thinks that he must betray Banquo even though Banquo never said that he would harm Macbeth.

*** How does Macbeth show that his resolve and ambition have become stronger?
**** Macbeth shows that his resolve and ambition have become stronger when Shakespeare hints that he has been possessed by evil through his rhymes similar to the witches. He also states that Lady Macbeth doesnt need to know about the murder and that she will be happy and proud, when in reality Lady Macbeth isnt worried about Banquo and would oppose his plan.

*** What is significant about Macbeth’s instructions to Lady Macbeth about how to treat Banquo at the state dinner that night?
**** Macbeth's instructions to Lady Macbeth are to be fake and phony and act normal like nothing happened. Macbeth is continuing the theme of the fair is foul, and foul is fair. The importance of this is that Macbeth has become how Lady Macbeth was acting when planning Duncan’s murder, revealing that he has become more evil and has poorer inentions than before killing Duncan.

** Scene 3:
*** What happens at the ambush?
**** The three murders kill Banquo but Fleance escapes. They decide not to chase after him as they only thought Banquo was their real enemy, and go to tell Macbeth of the news.

*** Given the previous scene in which Banquo’s death is planned, and the next scene in which the audience could learn with Macbeth that Fleance has escaped, why would Shakespeare choose to dramatize this seemingly insignificant event?
**** Shakespeare chooses to dramatize this event because he is foreshadowing how Fleance will have revenge on him, whether it is mentally or physically. Macbeth will always be mentally haunted in that he will be paranoid that Fleance will come back to kill him.

** Scene 4:
*** One characteristic of Shakespeare’s style is his play on words. How is this demonstrated in Macbeth’s response to the murderer’s saying it’s Banquo’s blood on his face?
**** The normal saying is that there is blood on your hands, meaning that the person has murdered someone and the guilt surrounds them. Macbeth’s response further entails that it is better that Banquo died than if he was alive, further proving Macbeth's paranoia and fear of other’s revenge.

*** What wordplay is there in the murderer's reply that Banquo is “safe” now?
**** Banquo is safe in that he is 100% dead and in heaven, aka “safe” in that he can not be harmed in the future. The play on words is that Macbeth is the one who is safe because he no longer has to worry about Banquo avenging King Duncan.

*** The dagger Macbeth saw in Act II, scene i was a hallucination. Banquo’s ghost in this scene is not. How do we know?
**** We know this is not a hallucination because Macbeth refuses to sit in the seat of Banquo’s ghost and talks to the Ghost as if it is a person. Macbeth also asks who pulled this prank on him to the others, trying to play it off, but still refuses to sit.

*** What does Lady Macbeth say to Macbeth?
**** Lady Macbeth says that he is not Manly enough and strong enough and that he is acting like a weak woman, actually like a womens grandmother. She insults him for how he is acting and says that he is shameful.

