APLit/MacbethQuestions.html
<li><a id="org93fd216"></a>The events that further the crime against nature theme are that because the two believe the servants had no motive to do it, and that the two sons are leaving the country but they think it is not because they bribed anyone, then the most likely person who would have commited the crime would be Macbeth, but he is said to be loyal to the King and such an honorable person, and it would not be right if he killed the person he cared about.<br /></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgadcc337" class="outline-2">
<h2 id="orgadcc337">Act 3</h2>
<div class="outline-text-2" id="text-orgadcc337">
</div>
<div id="outline-container-org2da2e25" class="outline-3">
<h3 id="org2da2e25">Scene 1:</h3>
<div class="outline-text-3" id="text-org2da2e25">
</div>
<ul class="org-ul">
<li><a id="org49f7890"></a>In his soliloquy, what suspicion and hope does Banquo reveal?<br />
<ul class="org-ul">
<li><a id="org2cf6f21"></a>Banquo reveals that he is suspicious of Macbeths treason and murder of king Duncan. He hopes that Macbeth did not take the witches prophecy into his own hands and that his friend is still good.<br /></li>
</ul>
</li>

<li><a id="orge40ebc5"></a>Macbeth seems to be very interested in Banquo’s travel plans. Why do you suppose he is so interested?<br />
<ul class="org-ul">
<li><a id="org9900788"></a>Macbeth is very interested in Banquo’s travel plans because he wants to know where he is and at what time inorder for the two murders to murder him. It would be wise to do it away from Macbeth&rsquo;s location so that he is not a suspect.<br /></li>
</ul>
</li>

<li><a id="org811ea58"></a>The speech beginning “To be thus is nothing&#x2026;” is another one often quoted. What is the meaning of that sentence?<br />
<ul class="org-ul">
<li><a id="orgb3e7d32"></a>The meaning of that sentence is that to be King is nothing, but to be safely king is remarkable. This is because as a King, you almost always have a target on your back as someone wants to kill you.<br /></li>
</ul>
</li>

<li><a id="org9ebe679"></a>What is there in Banquo’s character that makes Macbeth uneasy?<br />
<ul class="org-ul">
<li><a id="orga64c29c"></a>Macbeth is uneasy because he fears how Banquo is the good as he is honest and loyal, and fears that he will avenge the king and betray his friend.<br /></li>
</ul>
</li>

<li><a id="orgd13f3c4"></a>What is there in the situation with Banquo that particularly upsets Macbeth?<br />
<ul class="org-ul">
<li><a id="orgd37a6f6"></a>Macbeth is upset that Banquo’s sons will be the air to the throne because he is a fruitless crown, meaning he has no offspring and therefore the royal crown will not be in his blood. Banquo’s sons basically benefit from no troubles at all.<br /></li>
</ul>
</li>

<li><a id="org73c0577"></a>What does Shakespeare offer in Macbeth’s conversation with the murderers?<br />
<ul class="org-ul">
<li><a id="orge288050"></a>Shakespeare on the surface offers that Macbeth would do it himself if he was not king, but he is really stating that Macbeth will not have the ability to kill his best friend himself because there is still some good in him.<br /></li>
</ul>
</li>

<li><a id="orge0ea4cc"></a>How does Macbeth convince the murderers to kill Banquo and Fleance?<br />
<ul class="org-ul">
<li><a id="org9cfb278"></a>Macbeth manipulates the murders into thinking that Banquo is their enemy and has betrayed them. He makes them think that nothing should stop them from killing Banquo, which is why they are willing to kill Fleance.<br /></li>
</ul>
</li>

<li><a id="org876bd49"></a>What does Macbeth tell them to do?<br />
<ul class="org-ul">
<li><a id="org32e4dfe"></a>Macbeth tells them to kill Banquo and Fleance tonight before supper while he is off and away riding his horse. He tells them to make sure the deed is done and to end it here once and for all.<br /></li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-org1599af5" class="outline-3">
<h3 id="org1599af5">Scene 2:</h3>
<div class="outline-text-3" id="text-org1599af5">
</div>
<ul class="org-ul">
<li><a id="org16dd902"></a>What is the meaning of Lady Macbeth’s opening speech in this scene?<br />
<ul class="org-ul">
<li><a id="org3c22fbb"></a>Lady Macbeth&rsquo;s opening speech reveals how she is scared and worries that things will not turn out well. It shows that she might of just been going along with her husband and that she might truly be regretting the murder they commited. However, when she talks to Macbeth, she is back to her crazy relentless personality.<br /></li>
</ul>
</li>

<li><a id="orgd1e3a40"></a>In this scene, what is Macbeth’s state of mind?<br />
<ul class="org-ul">
<li><a id="org46a866f"></a>Macbeth’s state of mind is paranoia and is scared for his life. He wishes he was dead and that because of the betrayal of those close to him he is going to hell so becoming more evil is not as much of an issue anymore. He thinks that he must betray Banquo even though Banquo never said that he would harm Macbeth.<br /></li>
</ul>
</li>

<li><a id="orgf9169c7"></a>How does Macbeth show that his resolve and ambition have become stronger?<br />
<ul class="org-ul">
<li><a id="org19aedfc"></a>Macbeth shows that his resolve and ambition have become stronger when Shakespeare hints that he has been possessed by evil through his rhymes similar to the witches. He also states that Lady Macbeth doesnt need to know about the murder and that she will be happy and proud, when in reality Lady Macbeth isnt worried about Banquo and would oppose his plan.<br /></li>
</ul>
</li>

<li><a id="orgdb56a9e"></a>What is significant about Macbeth’s instructions to Lady Macbeth about how to treat Banquo at the state dinner that night?<br />
<ul class="org-ul">
<li><a id="orgb1f757e"></a>Macbeth&rsquo;s instructions to Lady Macbeth are to be fake and phony and act normal like nothing happened. Macbeth is continuing the theme of the fair is foul, and foul is fair. The importance of this is that Macbeth has become how Lady Macbeth was acting when planning Duncan’s murder, revealing that he has become more evil and has poorer inentions than before killing Duncan.<br /></li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-orgf67d5ef" class="outline-3">
<h3 id="orgf67d5ef">Scene 3:</h3>
<div class="outline-text-3" id="text-orgf67d5ef">
</div>
<ul class="org-ul">
<li><a id="org8b88800"></a>What happens at the ambush?<br />
<ul class="org-ul">
<li><a id="org3449b88"></a>The three murders kill Banquo but Fleance escapes. They decide not to chase after him as they only thought Banquo was their real enemy, and go to tell Macbeth of the news.<br /></li>
</ul>
</li>

<li><a id="org57775b2"></a>Given the previous scene in which Banquo’s death is planned, and the next scene in which the audience could learn with Macbeth that Fleance has escaped, why would Shakespeare choose to dramatize this seemingly insignificant event?<br />
<ul class="org-ul">
<li><a id="org496aa41"></a>Shakespeare chooses to dramatize this event because he is foreshadowing how Fleance will have revenge on him, whether it is mentally or physically. Macbeth will always be mentally haunted in that he will be paranoid that Fleance will come back to kill him.<br /></li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-org447d750" class="outline-3">
<h3 id="org447d750">Scene 4:</h3>
<div class="outline-text-3" id="text-org447d750">
</div>
<ul class="org-ul">
<li><a id="org8d97494"></a>One characteristic of Shakespeare’s style is his play on words. How is this demonstrated in Macbeth’s response to the murderer’s saying it’s Banquo’s blood on his face?<br />
<ul class="org-ul">
<li><a id="orgc72fc77"></a>The normal saying is that there is blood on your hands, meaning that the person has murdered someone and the guilt surrounds them. Macbeth’s response further entails that it is better that Banquo died than if he was alive, further proving Macbeth&rsquo;s paranoia and fear of other’s revenge.<br /></li>
</ul>
</li>

<li><a id="orga6d89f3"></a>What wordplay is there in the murderer&rsquo;s reply that Banquo is “safe” now?<br />
<ul class="org-ul">
<li><a id="orgefb8f6c"></a>Banquo is safe in that he is 100% dead and in heaven, aka “safe” in that he can not be harmed in the future. The play on words is that Macbeth is the one who is safe because he no longer has to worry about Banquo avenging King Duncan.<br /></li>
</ul>
</li>

<li><a id="orgf154b27"></a>The dagger Macbeth saw in Act II, scene i was a hallucination. Banquo’s ghost in this scene is not. How do we know?<br />
<ul class="org-ul">
<li><a id="org04a47c1"></a>We know this is not a hallucination because Macbeth refuses to sit in the seat of Banquo’s ghost and talks to the Ghost as if it is a person. Macbeth also asks who pulled this prank on him to the others, trying to play it off, but still refuses to sit.<br /></li>
</ul>
</li>

<li><a id="orgdcd3d62"></a>What does Lady Macbeth say to Macbeth?<br />
<ul class="org-ul">
<li><a id="orga220ffa"></a>Lady Macbeth says that he is not Manly enough and strong enough and that he is acting like a weak woman, actually like a womens grandmother. She insults him for how he is acting and says that he is shameful.<br /></li>
</ul>
</li>
