APLit/MacbethQuestions.org
*** What is the significance of the conversation Macbeth and Lady Macbeth have immediately after the guests leave?
**** The significance is that they can not tell what is good and what is evil anymore and think that they are trapped in an endless cycle of violence. “It will have blood, blood will have blood”. Both kind of act humanly in that they are both good and evil, as in one can be all of one thing, but humanity as a whole is a mixture of both.

*** For what reason does Macbeth mention Macduff’s name?
**** Macbeth mentions Macduff’s name because he is suspicious that he did not show up. He is starting to think that Macduff knows what's going on and is plotting revenge against Macbeth, which we later find out that he is.

*** What does Macbeth say he will do next?
**** Macbeth says that he will go visit the witches and hear out their prophecy. He also states that he is selfish in that he only cares now about what happens to himself and does not care about the people of scotland

*** What is Macbeth’s frame of mind?
**** Macbeth’s frame of mind is that there is more coming. More blood that will be on their hands and things that will go poorly. He has a strong feeling people are plotting against him and coming for him, and therefore has a strong paranoia about Banquo and Duncan’s sons.

** Scene 5:
*** Who is Hecate, and why is she angry?
**** Hecate is the god of witches. She is angry because the three witches went behind her back without her knowledge and cursed macbeth. She realizes she must fix the problem they created herself.

*** What is her plan for Macbeth?
**** Hecate plans to convince Macbeth that he will never die and make him so confident that it will lead to his downfall. Will tell him through the three sisters not to fear death and that he has safely secured the throne.

** Scene 6:
*** How can we interpret Lennox’s speech?
**** We can interpret Lennox’s speech as one with safely guarded words. Lennox is worried that the lord he is talking to might snitch or be a spy for Macbeth, so he chooses his words with care.

*** What further exposition does Shakespeare offer through the Lord?
**** The lord reveals that Macduff is requesting the help of England to remove Macbeth from the throne, and aligns himself with Macduff and not Macbeth. Shakespeare allows us to consider that because Banquo’s sons will take the throne, Duncan’s two sons will die in battle trying to avenge their father but Fleance will succeed and take the throne with the blood of Macbeth on his hands.

* Act 4
** Scene 1:
