APLit/MacbethQuestions.html

<li><a id="org5590ebd"></a>What is the significance of the conversation Macbeth and Lady Macbeth have immediately after the guests leave?<br />
<ul class="org-ul">
<li><a id="org9009152"></a>The significance is that they can not tell what is good and what is evil anymore and think that they are trapped in an endless cycle of violence. “It will have blood, blood will have blood”. Both kind of act humanly in that they are both good and evil, as in one can be all of one thing, but humanity as a whole is a mixture of both.<br /></li>
</ul>
</li>

<li><a id="org88fc8f8"></a>For what reason does Macbeth mention Macduff’s name?<br />
<ul class="org-ul">
<li><a id="org345e83a"></a>Macbeth mentions Macduff’s name because he is suspicious that he did not show up. He is starting to think that Macduff knows what&rsquo;s going on and is plotting revenge against Macbeth, which we later find out that he is.<br /></li>
</ul>
</li>

<li><a id="org852e453"></a>What does Macbeth say he will do next?<br />
<ul class="org-ul">
<li><a id="org604f384"></a>Macbeth says that he will go visit the witches and hear out their prophecy. He also states that he is selfish in that he only cares now about what happens to himself and does not care about the people of scotland<br /></li>
</ul>
</li>

<li><a id="org0135228"></a>What is Macbeth’s frame of mind?<br />
<ul class="org-ul">
<li><a id="orgdf36bb4"></a>Macbeth’s frame of mind is that there is more coming. More blood that will be on their hands and things that will go poorly. He has a strong feeling people are plotting against him and coming for him, and therefore has a strong paranoia about Banquo and Duncan’s sons.<br /></li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-org1c9edd7" class="outline-3">
<h3 id="org1c9edd7">Scene 5:</h3>
<div class="outline-text-3" id="text-org1c9edd7">
</div>
<ul class="org-ul">
<li><a id="org39a1005"></a>Who is Hecate, and why is she angry?<br />
<ul class="org-ul">
<li><a id="org7333e1b"></a>Hecate is the god of witches. She is angry because the three witches went behind her back without her knowledge and cursed macbeth. She realizes she must fix the problem they created herself.<br /></li>
</ul>
</li>

<li><a id="orga9015e7"></a>What is her plan for Macbeth?<br />
<ul class="org-ul">
<li><a id="orgeb17e83"></a>Hecate plans to convince Macbeth that he will never die and make him so confident that it will lead to his downfall. Will tell him through the three sisters not to fear death and that he has safely secured the throne.<br /></li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-orgb087671" class="outline-3">
<h3 id="orgb087671">Scene 6:</h3>
<div class="outline-text-3" id="text-orgb087671">
</div>
<ul class="org-ul">
<li><a id="orgc337f73"></a>How can we interpret Lennox’s speech?<br />
<ul class="org-ul">
<li><a id="org00af482"></a>We can interpret Lennox’s speech as one with safely guarded words. Lennox is worried that the lord he is talking to might snitch or be a spy for Macbeth, so he chooses his words with care.<br /></li>
</ul>
</li>

<li><a id="org3627938"></a>What further exposition does Shakespeare offer through the Lord?<br />
<ul class="org-ul">
<li><a id="org44bf93c"></a>The lord reveals that Macduff is requesting the help of England to remove Macbeth from the throne, and aligns himself with Macduff and not Macbeth. Shakespeare allows us to consider that because Banquo’s sons will take the throne, Duncan’s two sons will die in battle trying to avenge their father but Fleance will succeed and take the throne with the blood of Macbeth on his hands.<br /></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgc2fd67e" class="outline-2">
<h2 id="orgc2fd67e">Act 4</h2>
<div class="outline-text-2" id="text-orgc2fd67e">
</div>
<div id="outline-container-org7abb559" class="outline-3">
<h3 id="org7abb559">Scene 1:</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alex Burns</p>
<p class="date">Created: 2021-09-25 Sat 11:47</p>
</div>
</body>
</html>
